In [1]:
!pip install -r requirements.txt

Requirement already satisfied: numpy in /opt/conda/lib/python3.8/site-packages (from -r requirements.txt (line 1)) (1.20.2)
Requirement already satisfied: pandas in /opt/conda/lib/python3.8/site-packages (from -r requirements.txt (line 2)) (1.2.4)
Collecting sklearn
  Using cached sklearn-0.0-py2.py3-none-any.whl
Requirement already satisfied: python-dateutil>=2.7.3 in /opt/conda/lib/python3.8/site-packages (from pandas->-r requirements.txt (line 2)) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in /opt/conda/lib/python3.8/site-packages (from pandas->-r requirements.txt (line 2)) (2021.1)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas->-r requirements.txt (line 2)) (1.15.0)
Collecting scikit-learn
  Using cached scikit_learn-0.24.2-cp38-cp38-manylinux2010_x86_64.whl (24.9 MB)
Collecting joblib>=0.11
  Using cached joblib-1.0.1-py3-none-any.whl (303 kB)
Collecting threadpoolctl>=2.0.0
  Using cached threadpoolctl-2.1.0-py3-none-any.whl (12 kB)
Collecting scipy>=0.19.1
  Using cached scipy-1.6.3-cp38-cp38-manylinux1_x86_64.whl (27.2 MB)
Installing collected packages: threadpoolctl, scipy, joblib, scikit-learn, sklearn
Successfully installed joblib-1.0.1 scikit-learn-0.24.2 scipy-1.6.3 sklearn-0.0 threadpoolctl-2.1.0

In [2]:
import sklearn
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv('data/Todays_Attendance_2021_06_02_20_49.csv')
df.head()

,DBN,School_Name,ATTN_PCT,OnlinePresence,InPersonPresence,Borough,DistrictCode,ATTN_DATE_YMD
0,01M015,P.S. 015 ROBERTO CLEMENTE,91.25,89.02,93.06,Manhattan,1,6/2/2021 0:00
1,01M019,P.S. 019 ASHER LEVY,93.23,94.08,89.47,Manhattan,1,6/2/2021 0:00
2,01M020,P.S. 020 ANNA SILVER,92.64,91.80,95.14,Manhattan,1,6/2/2021 0:00
3,01M034,P.S. 034 FRANKLIN D. ROOSEVELT,90.32,87.56,95.74,Manhattan,1,6/2/2021 0:00
4,01M063,THE STAR ACADEMY P.S.63,93.33,90.00,98.75,Manhattan,1,6/2/2021 0:00

In [4]:
len(df)

1605

In [5]:
df.shape

(1605, 8)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1605 entries, 0 to 1604
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   DBN               1605 non-null   object
 1   School_Name       1605 non-null   object
 2   ATTN_PCT          1605 non-null   object
 3   OnlinePresence    1509 non-null   float64
 4   InPersonPresence  1369 non-null   float64
 5   Borough           1605 non-null   object
 6   DistrictCode      1605 non-null   int64
 7   ATTN_DATE_YMD     1605 non-null   object
dtypes: float64(2), int64(1), object(5)
memory usage: 100.4+ KB

In [7]:
df.describe()

       OnlinePresence  InPersonPresence  DistrictCode
count     1509.000000       1369.000000   1605.000000
mean        87.023048         89.871534     18.328972
std         12.272051         11.606152     14.571697
min         14.400000          5.260000      1.000000
25%         83.160000         88.630000      9.000000
50%         90.450000         92.850000     16.000000
75%         95.060000         96.030000     26.000000
max        100.000000        100.000000     93.000000

In [8]:
df.describe(include=[object])

           DBN School_Name ATTN_PCT   Borough  ATTN_DATE_YMD
count     1605        1605     1605      1605           1605
unique    1605        1602     1102         5              1
top     19K345    P.S. 376      INC  Brooklyn  6/2/2021 0:00
freq         1           2       89       488           1605

In [9]:
df.nunique()

DBN                 1605
School_Name         1602
ATTN_PCT            1102
OnlinePresence      1100
InPersonPresence     819
Borough                5
DistrictCode          35
ATTN_DATE_YMD          1
dtype: int64

In [10]:
df.isnull().sum()

DBN                   0
School_Name           0
ATTN_PCT              0
OnlinePresence       96
InPersonPresence    236
Borough               0
DistrictCode          0
ATTN_DATE_YMD         0
dtype: int64

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1605 entries, 0 to 1604
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   DBN               1605 non-null   object
 1   School_Name       1605 non-null   object
 2   ATTN_PCT          1605 non-null   object
 3   OnlinePresence    1509 non-null   float64
 4   InPersonPresence  1369 non-null   float64
 5   Borough           1605 non-null   object
 6   DistrictCode      1605 non-null   int64
 7   ATTN_DATE_YMD     1605 non-null   object
dtypes: float64(2), int64(1), object(5)
memory usage: 100.4+ KB

In [12]:
df['OnlinePresence'].fillna(df['OnlinePresence'].mean())

0       89.02
1       94.08
2       91.80
3       87.56
4       90.00
        ...
1600    85.50
1601    96.38
1602    93.80
1603    90.62
1604    91.07
Name: OnlinePresence, Length: 1605, dtype: float64

In [13]:
df['InPersonPresence'].fillna(df['InPersonPresence'].mean())

0       93.06
1       89.47
2       95.14
3       95.74
4       98.75
        ...
1600    87.09
1601    94.66
1602    96.58
1603    97.02
1604    89.24
Name: InPersonPresence, Length: 1605, dtype: float64

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1605 entries, 0 to 1604
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   DBN               1605 non-null   object
 1   School_Name       1605 non-null   object
 2   ATTN_PCT          1605 non-null   object
 3   OnlinePresence    1509 non-null   float64
 4   InPersonPresence  1369 non-null   float64
 5   Borough           1605 non-null   object
 6   DistrictCode      1605 non-null   int64
 7   ATTN_DATE_YMD     1605 non-null   object
dtypes: float64(2), int64(1), object(5)
memory usage: 100.4+ KB

In [15]:
df.head()

,DBN,School_Name,ATTN_PCT,OnlinePresence,InPersonPresence,Borough,DistrictCode,ATTN_DATE_YMD
0,01M015,P.S. 015 ROBERTO CLEMENTE,91.25,89.02,93.06,Manhattan,1,6/2/2021 0:00
1,01M019,P.S. 019 ASHER LEVY,93.23,94.08,89.47,Manhattan,1,6/2/2021 0:00
2,01M020,P.S. 020 ANNA SILVER,92.64,91.80,95.14,Manhattan,1,6/2/2021 0:00
3,01M034,P.S. 034 FRANKLIN D. ROOSEVELT,90.32,87.56,95.74,Manhattan,1,6/2/2021 0:00
4,01M063,THE STAR ACADEMY P.S.63,93.33,90.00,98.75,Manhattan,1,6/2/2021 0:00

In [16]:
df = pd.read_csv('data/Todays_Attendance_2021_06_02_20_49.csv', 
                 index_col=0, parse_dates=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1605 entries, 01M015 to 30Q389
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   School_Name       1605 non-null   object
 1   ATTN_PCT          1605 non-null   object
 2   OnlinePresence    1509 non-null   float64
 3   InPersonPresence  1369 non-null   float64
 4   Borough           1605 non-null   object
 5   DistrictCode      1605 non-null   int64
 6   ATTN_DATE_YMD     1605 non-null   object
dtypes: float64(2), int64(1), object(4)
memory usage: 100.3+ KB

In [17]:
df.head()

,School_Name,ATTN_PCT,OnlinePresence,InPersonPresence,Borough,DistrictCode,ATTN_DATE_YMD
DBN,,,,,,,
01M015,P.S. 015 ROBERTO CLEMENTE,91.25,89.02,93.06,Manhattan,1,6/2/2021 0:00
01M019,P.S. 019 ASHER LEVY,93.23,94.08,89.47,Manhattan,1,6/2/2021 0:00
01M020,P.S. 020 ANNA SILVER,92.64,91.80,95.14,Manhattan,1,6/2/2021 0:00
01M034,P.S. 034 FRANKLIN D. ROOSEVELT,90.32,87.56,95.74,Manhattan,1,6/2/2021 0:00
01M063,THE STAR ACADEMY P.S.63,93.33,90.00,98.75,Manhattan,1,6/2/2021 0:00

In [18]:
df['Borough'] = df['Borough'].str.upper()

In [19]:
df.head()

,School_Name,ATTN_PCT,OnlinePresence,InPersonPresence,Borough,DistrictCode,ATTN_DATE_YMD
DBN,,,,,,,
01M015,P.S. 015 ROBERTO CLEMENTE,91.25,89.02,93.06,MANHATTAN,1,6/2/2021 0:00
01M019,P.S. 019 ASHER LEVY,93.23,94.08,89.47,MANHATTAN,1,6/2/2021 0:00
01M020,P.S. 020 ANNA SILVER,92.64,91.80,95.14,MANHATTAN,1,6/2/2021 0:00
01M034,P.S. 034 FRANKLIN D. ROOSEVELT,90.32,87.56,95.74,MANHATTAN,1,6/2/2021 0:00
01M063,THE STAR ACADEMY P.S.63,93.33,90.00,98.75,MANHATTAN,1,6/2/2021 0:00

In [22]:
df = df.rename(columns = {"ATTN_PCT":"Attn_Pct", 
                            "OnlinePresence":"Online_Presence",
                         "InPersonPresence":"In_Person_Presence",
                         "DistrictCode":"District_Code",
                         "ATTN_DATE_YMD":"Attn_Date_YMD"})

In [23]:
df.head()

,School_Name,Attn_Pct,Online_Presence,In_Person_Presence,Borough,District_Code,Attn_Date_YMD
DBN,,,,,,,
01M015,P.S. 015 ROBERTO CLEMENTE,91.25,89.02,93.06,MANHATTAN,1,6/2/2021 0:00
01M019,P.S. 019 ASHER LEVY,93.23,94.08,89.47,MANHATTAN,1,6/2/2021 0:00
01M020,P.S. 020 ANNA SILVER,92.64,91.80,95.14,MANHATTAN,1,6/2/2021 0:00
01M034,P.S. 034 FRANKLIN D. ROOSEVELT,90.32,87.56,95.74,MANHATTAN,1,6/2/2021 0:00
01M063,THE STAR ACADEMY P.S.63,93.33,90.00,98.75,MANHATTAN,1,6/2/2021 0:00

In [25]:
df['Attn_Date_YMD'] = pd.to_datetime(df.Attn_Date_YMD)

In [26]:
df.head()

,School_Name,Attn_Pct,Online_Presence,In_Person_Presence,Borough,District_Code,Attn_Date_YMD
DBN,,,,,,,
01M015,P.S. 015 ROBERTO CLEMENTE,91.25,89.02,93.06,MANHATTAN,1,2021-06-02
01M019,P.S. 019 ASHER LEVY,93.23,94.08,89.47,MANHATTAN,1,2021-06-02
01M020,P.S. 020 ANNA SILVER,92.64,91.80,95.14,MANHATTAN,1,2021-06-02
01M034,P.S. 034 FRANKLIN D. ROOSEVELT,90.32,87.56,95.74,MANHATTAN,1,2021-06-02
01M063,THE STAR ACADEMY P.S.63,93.33,90.00,98.75,MANHATTAN,1,2021-06-02

In [27]:
df.to_csv('data/clean_todays_attendance.csv', encoding='utf-8')